; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-71)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 - object)
 (:init 
    (arm-empty)
    (clear b17)
    (on b17 b10)
    (on b10 b7)
    (on-table b7)
    (clear b6)
    (on b6 b3)
    (on b3 b1)
    (on b1 b13)
    (on b13 b4)
    (on b4 b15)
    (on b15 b16)
    (on b16 b9)
    (on b9 b11)
    (on b11 b18)
    (on b18 b5)
    (on b5 b8)
    (on b8 b20)
    (on b20 b14)
    (on b14 b21)
    (on b21 b2)
    (on b2 b19)
    (on b19 b12)
    (on-table b12))
 (:goal (and 
(on-table b7)
(clear b8) (on b8 b16)
))
)

; plan
1. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 1 of 3
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 3
3. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 1 of 3
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 3
5. (unstack b1 b13)
   deleted: (on b1 b13) (clear b1) (arm-empty)
   added: (holding b1) (clear b13)
   goals met: 1 of 3
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 3
7. (unstack b13 b4)
   deleted: (on b13 b4) (clear b13) (arm-empty)
   added: (holding b13) (clear b4)
   goals met: 1 of 3
8. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 3
9. (unstack b4 b15)
   deleted: (on b4 b15) (clear b4) (arm-empty)
   added: (holding b4) (clear b15)
   goals met: 1 of 3
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 3
11. (unstack b15 b16)
   deleted: (on b15 b16) (clear b15) (arm-empty)
   added: (holding b15) (clear b16)
   goals met: 1 of 3
12. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 3
13. (unstack b16 b9)
   deleted: (on b16 b9) (clear b16) (arm-empty)
   added: (holding b16) (clear b9)
   goals met: 1 of 3
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 3
15. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 1 of 3
16. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 3
17. (unstack b11 b18)
   deleted: (on b11 b18) (clear b11) (arm-empty)
   added: (holding b11) (clear b18)
   goals met: 1 of 3
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 3
19. (unstack b18 b5)
   deleted: (on b18 b5) (clear b18) (arm-empty)
   added: (holding b18) (clear b5)
   goals met: 1 of 3
20. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 3
21. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 2 of 3
22. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 3
23. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 1 of 3
24. (stack b8 b16)
   deleted: (clear b16) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b16)
   goals met: 3 of 3
